** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.77.query.scm")
  ;; Test
  (display "Non-programmers supervised by a rich boss")
  (mc-eval
   '(and (not (job ?emp (computer . ?job-rest)))
         (lisp-value > ?sup-sal 100000)
         (supervisor ?emp ?sup)
         (salary ?sup ?sup-sal)))
#+end_src

#+RESULTS:
: Non-programmers supervised by a rich boss
: ;;; Query results:
: (and (not (job (aull dewitt) (computer . ?job-rest))) (lisp-value > 150000 100000) (supervisor (aull dewitt) (warbucks oliver)) (salary (warbucks oliver) 150000))
: (and (not (job (scrooge eben) (computer . ?job-rest))) (lisp-value > 150000 100000) (supervisor (scrooge eben) (warbucks oliver)) (salary (warbucks oliver) 150000))
